Revit 2027 API
SlabShapeEditor.AddSplitLine Method
 Add a split line to the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<SlabShapeCrease> AddSplitLine(
	SlabShapeVertex startVertex,
	SlabShapeVertex endVertex
)
Public Function AddSplitLine (
	startVertex As SlabShapeVertex,
	endVertex As SlabShapeVertex
) As IList(Of SlabShapeCrease)
public:
IList<SlabShapeCrease^>^ AddSplitLine(
	SlabShapeVertex^ startVertex,
	SlabShapeVertex^ endVertex
)
member AddSplitLine :
        startVertex : SlabShapeVertex *
        endVertex : SlabShapeVertex -> IList<SlabShapeCrease>
Parameters
startVertex SlabShapeVertex
 Start vertex
endVertex SlabShapeVertex
 End vertex
Return Value
IList<SlabShapeCrease>
 The newly created creases after adding the split line.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Adding a split line may result in multiple creases, for example when the line crosses existing creases or boundary edges.
See Also
Reference
SlabShapeEditor Class
Autodesk.Revit.DB Namespace